In [1]:
import pandas as pd
import numpy as np

In [3]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity='all'

# pandas 데이터 재구조화(reshaping)

- 피버팅(pivoting)
- 스태킹(stacking)과 언스태킹(unstacking)
- 멜팅(melting)과 와이드투롱(wide_to_long)
- 교차표(crosstab)

## 1. 피벗팅(pivoting)

### Pivoting

- 쌓여있는(stacked/long) 데이터를 원하는 형태로 가공하여(record/wide) 재구조화된 형식으로 보여주는 것
- stacked or long format -> record or wide format
    - stacked format : 각 주제(subject)에 대해 여러 행이 존재하는 형식
- 자료의 형태를 변경하기 위해 많이 사용하는 방법

### 피버팅을 위한 메소드 : **pivot(), pivot_table()**

### pivot( )
- pandas.pivot(data, index=None, columns=None, values=None)
- DataFrame.pivot(index=None, columns=None, values=None)
- https://pandas.pydata.org/docs/reference/api/pandas.pivot.html
- https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.pivot.html

### pivot_table( )

- 방법 : **두 개의 키를 사용**해서 데이터를 선택



- **pivot_table(data, index=None, columns=None, values=None**,
    aggfunc='mean', fill_value=None, margins=False, dropna=True, margins_name='All', observed=False, sort=True)
    
    - data : 분석할 데이터 프레임의 메서드 형식일 때는 필요하지 않음 
        - ex1. pandas.pivot_table(df1, )
        - ex2. df1.pivot_table()
    - index :  **행 인덱스**로 들어갈 키열 또는 키열의 리스트
    - columns : **열 인덱스**로 들어갈 키열 또는 키열의 리스트
    - values : 분석할 데이터 프레임에서 분석할 열
    - fill_value : NaN이 표출될 때 대체값 지정
    - margins : 모든 데이터를 분석한 결과를 행으로 표출할 지 여부
    - margins_name : margins가 표출될 때 그 열(행)의 이름`

- **피벗테이블을 작성할 때 반드시 설정해야 되는 인수**
    - data : 사용 데이터 프레임
    - index : 행 인덱스로 사용할 필드(기준 필드로 작용됨)
    - values : 인덱스 명을 제외한 나머지 값(data)은 수치 data 만 사용함
    - aggfunc: 기본 함수가 평균(mean)함수 이기 때문에 각 데이터의 평균값이 반환

- https://pandas.pydata.org/docs/reference/api/pandas.pivot_table.html
- https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.pivot_table.html

### 예제1. pivot() 사용

In [5]:
data = {"도시": ["서울", "서울", "서울", "부산", "부산", "부산", "인천", "인천"],
        "연도": ["2015", "2010", "2005", "2015", "2010", "2005", "2015", "2010"],
        "인구": [9904312, 9631482, 9762546, 3448737, 3393191, 3512547, 2890451, 263203],
        "지역": ["수도권", "수도권", "수도권", "경상권", "경상권", "경상권", "수도권", "수도권"]
}
df = pd.DataFrame(data)

In [6]:
df

   도시    연도       인구   지역
0  서울  2015  9904312  수도권
1  서울  2010  9631482  수도권
2  서울  2005  9762546  수도권
3  부산  2015  3448737  경상권
4  부산  2010  3393191  경상권
5  부산  2005  3512547  경상권
6  인천  2015  2890451  수도권
7  인천  2010   263203  수도권

In [9]:
df.pivot(values = '인구', index= '연도', columns='도시')

도시           부산         서울         인천
연도
2005  3512547.0  9762546.0        NaN
2010  3393191.0  9631482.0   263203.0
2015  3448737.0  9904312.0  2890451.0

In [10]:
df.pivot(values='인구',index=['도시','지역'],columns='연도')

연도           2005       2010       2015
도시 지역
부산 경상권  3512547.0  3393191.0  3448737.0
서울 수도권  9762546.0  9631482.0  9904312.0
인천 수도권        NaN   263203.0  2890451.0

----